[
{
	"name":"Amplify",
	"ownership":"Amazon",
  	"useCase":"mobile SDKs to connect to AWS infra."
},
{
	"name":"App Runner",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"Point at container and it handles all the orchestration."
},
{
	"freeTier":"100 minutes on general1.small compute type per month.",
	"paidTier":"$0.005/minute, after the free tier is used up.",
	"encryption":"KMS",
	"name":"CodeBuild",
	"ownership":"Amazon",
	"Website":"https://aws.amazon.com/codebuild/",
	"stack":"CI/CD",
	"type":"SaaS",
	"useCase":"Serverless code build and test.",
	"notes":[
		"Has Jenkins plugin."
	]
},
{
	"name":"Bracket",
	"ownership":"Amazon",
	"stack":"Specialized Compute",
	"type":"IaaS",
	"useCase":"Quantum Computing"
},
{
	"cost":"free",
	"encryption":"SSL",
	"name":"CLI",
	"ownership":"Amazon",
	"type":"ControlPlane",
	"useCase":"perform various tasks like list buckets, upload data, launch, start, stop, and terminate EC2 instances, update security groups, create subnets, etc.",
	"notes": [
	"Easily switch between accounts with --profile",
	"Change --output between JSON, Table, and Text.",
	"Programmatic Access must be setup from IAM",
	"aws configure command sets up IAM keys, stored plaintext on the filesystem, so use roles instead wherever possible.",
	"Installed via Python script"
	]
},
{
	"encryption":"are templates encrypted?",
	"name":"CloudFormation",
	"type":"IaaS",
	"ownership":"Amazon",
	"stack":"IaC",
	"useCase":"automate the provisioning of resources and Infrastructure As Code.",
	"notes": [
		"JSON or YAML",
		"Errors rollback with message 'ROLLBACK_IN_PROGRESS'"
	],
	"CloudFormation Templates": [
		"Must define at least one resource.",
		"Larger than 51,200 bytes (0.05 MB) must be imported from S3 bucket",
		"Can be nested into NestedStacks."
	],
	"Fields": [
		"MetaData: extra info",
		"Description: of the template",
		"Parameters: user inputs",
		"Transforms: Macros to modify data.",
		"Outputs: Become inputs into other stacks.",
		"Mappings: key value lookup table",
		"Resources: define what to provision (minimum 1)",
		"Conditions: control if resources get created and/or properties assigned."
		]
},
{
	"freeTier":[
		"1 TB of data transfer out",
		"10,000,000 HTTP/S Requests",
		"2,000,000 CloudFront Function Invocations."
	],
	"paidTier":"First 10TB $0.085",
	"encryption":"(Are there use cases for non-public CDNs, like large companies? Does Amazon/AWS use CDNs to accelerate internal proprietary content? Are the edge copies encrypted?)",
	"name":"CloudFront",
	"ownership":"Amazon",
	"stack":"CDN",
	"type":"IaaS",
	"useCase":"Distributes cached copies to Edge Locations for faster worldwide retrieval.",
	"notes": [
		"Origin is storage location of data. (S3, Private S3 through Origin Access Identity (OAI), EC2, ELB, R53, etc)",
		"Distribution defines a collection of Edge Locations and behavior on how it should handle your cached content.",
		"2 types: Web (static content) and RTMP (streaming media) ",
		"Security through Signed URLs or Signed Cookies.",
		"Write to Edge Locations with verbs like PUT objects. (How does this work and what are the use cases? Invalidate cache for a specific location, or A/B test stuff in a specific region?)",
		"Lambda@Edge allows passing requests through a Lambda to transform.",
		"TTL defines cache expiry in seconds.",
		"Invalidating cache immediately expires the cached items, so they refresh immediately.",
		"Refreshing a cached item has a bandwidth cost of moving the item from origin to edge."
	]
},
{
	"encryption":[
		"Trails sent to S3 can use S3-KMS.",
		"Are trails not in S3 encrypted?"
		],
	"name":"CloudTrail",
	"ownership":"Amazon",
	"stack":"Monitoring",
	"type":"SaaS",
	"useCase":"Logs calls between AWS services.",
	"notes": [
		"Involves governance, compliance, operational auditing, and risk auditing.",
		"Can be configured to gather all logs in all regions in all accounts across an AWS Organization.",
		"Default is 90 days via Event History, and beyond 90 days requires creating a Trail, which is logged to an S3 bucket, and can be analyzed with Athena."
	],
	"CloudTrail Logs":[
		"Log Validation prevents tampering. (How?)",
		"Can be streamed to Logs",
		"2 event kinds: management (operations like IAM) and data (resources like EC2 or Lambda). Trails don't include data events by default."
	]
},
{
	"name":"CloudWatch",
	"ownership":"Amazon",
	"stack":"Monitoring",
	"type":"SaaS",
	"useCase":"Monitoring",
	"notes": [
		"Collection of monitoring services: Dashboards, Events, Alarms, Logs, Metrics",
		"Most services default to 1 minute reporting intervals, with options for 1, 3, and 5.",
		"EC2 starts with 5 and calls the 1 min option 'detailed monitoring' (does it cost more?) - Agent required.",
		"Can track the amount of billable data written to your AWS accounts.",
		"Can stream custom logs too."
	],
	"Dashboards": [
		"Visualize metrics"
	],
	"Events": [
		"Trigger AWS events based on condition (use case hourly snapshots)"
	],
	"Alarms": [
		"Notifications based on metrics"
	],
	"Logs": [
		"Data point logging",
		"Must belong to log group"
	],
	"Metrics": [
		"Capture one data point across time.",
		"Custom Metrics allow much higher resolution, down to 1 second."
	]
},
{
	"encryption":"Are user pools and identity pools encrypted? Where are they stored?",
	"name":"Cognito",
	"ownership":"Amazon",
	"stack":"IdP",
	"type":"SaaS",
	"useCase":"Decentralized managed auth.",
	"notes": [
		"User Pools directory allows users to auth using OAuth to IdP (Meta, AZ, Netflix?, Google, AAD, itself, etc) ",
		"Uses JWTs to persist auth",
		"Identity Pools can provide temp AWS creds for service access (S3, DynamoDB, etc)",
		"Cognito Sync can sync user data and preferences across devices with one line of code (powered by SNS)",
		"Web Identity Federation exchanges identity and security info between IdP and apps.",
		"IdP is a trusted login source for other services.",
		"OIDC is an Oauth type of IdP.",
		"SAML is an SSO type of IdP."
	]
},
{
	"name":"Data Exchange",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"Buy someone else's data to process, or use 3rd party data"
},
{
	"name":"Datasync",
	"ownership":"Amazon",
	"stack":"Data logistics",
	"type":"IaaS",
	"useCase":"Data transfer agent deployed on a VM in your network, an EC2 Outpost in your network, or on an AWS Snowcone in your network."
},
{
	"name":"Deep Racer",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"RC car that you can program with ML "
},
{
	"name":"DocumentDB (ODS)",
	"ownership":"Amazon",
	"stack":"Document DB",
	"type":"PaaS",
	"useCase":"notMongoDB with 1:1 to be allowed to charge money for open sourced applications."
},
{
	"name":"DynamoDB (ODS)",
	"ownership":"Amazon",
	"stack":"Document DB",
	"type":"PaaS",
	"useCase":"Fully managed NOSQL key/value & document DB.",
	"notes": [
		"Easy to scale document DB, but no joins and limited queries.",
		"Good for applications with large amounts of data and need predictable read & write while scaling.",
		"Scales to meet the specified read and write (per second) capacities.",
		"Data stored as 3 copies on SSDs in 3 regions.",
		"Two consistency modes: ",
		"Eventually (1 sec) Consistent Reads - can return inconsistent immediate reads too.",
		"Strongly Consistent Reads - will wait until data is consistent (1 sec) before returning, with higher latencies due to no immediate read option."
	]
},
{
	"encryption":"KMS?",
	"name":"EBS",
	"ownership":"Amazon",
	"stack":"Persistent Storage",
	"type":"IaaS",
	"useCase":"virtual block-level storage drive that you can attach to a single EC2 instance.",
	"notes": [
		"Volume dimensions (size, storage type) can be changed at any time.",
		"Instance Store Volumes are physical storage attached to a host, and cannot be stopped  - if the host fails, the data is lost. (What is the use case for these?)",
		"EBS backed instances can be stopped without data loss.",
		"Root volumes delete on termination by default.",
		"Volumes can have termination protection."
	],
	"Snapshots":[
		"Snapshots are incremental point-in-time copies, and only changes made since the last snapshot are moved to S3.",
		"Initial snapshots will take longer than subsequent snapshots.",
		"EC2 instance should be stopped before snapshotting root volume. But other disks can be taken while the server is running.",
		"Restoring a snapshots of an encrypted volume will give you a snapshot that is still encrypted, and you can't share encrypted snapshots.",
		"Unencrypted snapshots can be shared with other AWS accounts or made public. (Why would you want to make a snapshot public?)",
		"AMIs can be created from snapshots, or volumes."
	]
},
{
	"name":"EC2",
	"ownership":"Amazon",
	"useCase":"Servers as a service",
	"type":"IaaS",
	"EC2-AMI":[],
	"EC2-ASG":[],
	"EC2-NAT":[],
	"EC2-pricing":[],
	"EC2-pricing2":[]
},
{
	"name":"ElastiCache (ODS)",
	"ownership":"Amazon",
	"stack":"Caching DB",
	"type":"PaaS",
	"useCase":"Fully managed Redis in-memory database."
},
{
	"cost":" ~$0.55/day or $18/month.",
	"encryption":"All can hold SSL certs",
	"name":"ELB",
	"ownership":"Amazon",
	"type":"IaaS",
	"useCase":"Split traffic from one destination across numerous servers.",
	"notes": [
		"3 flavors: Network, Application, Classic"
	],
	"Application": [
		"Has Listeners, Rules, and Target Groups",
		"For HTTP(S) and is good for web apps.",
		"Can attach WAF. (Goes in front?)",
		"Advanced routing rules (can route based on subdomain header, path, and other HTTP(S) info.)",
		"Can have sticky sessions which are remembered by cookie."
	],
	"Network": [
		"Has Listeners and Target Groups but is a lawless place.",
		"For TCP/UDP and is good for high throughput i.e. video games.",
		"Can't have sticky sessions?"
	],
	"Classic": [
		"Has Listeners with EC2 instances registered directly.",
		"For legacy and is being depreciated",
		"Can have sticky sessions which are remembered by cookie.",
		"Must have at least 2 AZs",
		"Cannot be cross-region.",
		"X-Forwarded-For header has source IP."
	]
},
{
	"name":"ES (ODS)",
	"ownership":"Amazon",
	"stack":"Search DB",
	"type":"PaaS"
},
{
	"name":"FSx",
	"ownership":"Amazon",
	"stack":"Persistent Data Storage",
	"type":"PaaS"
},
{
	"name":"Fargate",
	"ownership":"Amazon",
	"stack":"Platform",
	"type":"SaaS",
	"useCase":"Run containers without worrying about servers."
},
{
	"name":"Athena (ODS)",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"Query data in s3 tables as though it were a database.",
	"notes":[
		"Depends on Glue to connect it to s3.",
		"Glue assembles tables for Athena from s3 buckets. If a user can access ALL s3 buckets in a table, then Glue will make it available to Athena for the user to query."
	]
},
{
	"cost":"free",
	"name":"Glue",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Serverless ETL that can connect to other data sets, and has a no-code studio.",
	"notes":[
		"Glue assembles tables for Athena from s3 buckets. If a user can access ALL s3 buckets in a table, then it will be available in Athena to be queried."
	]
},
{
	"name":"Graviton CPUs",
	"ownership":"Amazon",
	"type":"IaaS",
	"video":"<iframe width='560' height='315' src='https://www.youtube.com/embed/iwSQRLzDwHA' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>"
},
{
	"name":"Ground Station",
	"ownership":"Amazon",
	"type":"IaaS",
	"useCase":"Contact satellites in orbit around the Earth."
},
{
	"name":"Honeycode",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Write functions without code"
},
{
	"cost":"free",
	"encryption":"Are your policies encrypted at rest?",
	"name":"IAM",
	"type":"PaaS",
	"ownership":"Amazon",
	"stack":"Access",
	"useCase":"Used to manage AWS access.",
	"notes": [
		"Foundational",
		"Universal system, applies to all regions at once.",
		"AWS account creation normally starts with root user account setup.",
		"Always setup MFA for root accounts.",
		"New accounts have no permissions until assigned.",
		"New users get an access key and secret key when created with the programmatic access option set.",
		"Access keys are only for CLI / SDK access and not for console access.",
		"Access secret keys are only shown on creation - if lost they must be made again.",
		"Users must setup MFA for themselves, and this can't be done by an admin. (is this true?)",
		"IAM allows setting password policies like minimum length or rotation time.",
		"IAM identities are users, groups, and roles.",
		"IAM user accounts allow users to use the AWS Console, or CLI or SDK.",
		"IAM Groups allow grouping users with the same permissions.",
		"IAM Roles associate permissions with a resource.",
		"IAM Policies are JSON documents listing specific permissions.",
		"Managed Policies are read-only from AWS",
		"Customer Policies are ones you make and maintain.",
		"Inline Policies are directly attached to a user, group, or resource.",
		"List Policies can be listed in the AWS Console and are not directly attached."
	]
},
{
	"name":"IOT",
	"ownership":"Amazon",
	"IOT Core":[
		"logging"
	]
},
{
	"name":"Kinesis",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Captures realtime data stream "
},
{
	"name":"Lake Formation",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Create data lakes, or repositories of unstructured data."
},
{
	"cost":" Pay per invocation (CPU time and memory size, rounded to nearest 100 ms, and based on requests. First 1M requests are free.) ",
	"name":"Lambda",
	"ownership":"Amazon",
	"stack":"Function invocation",
	"type":"PaaS",
	"useCase":"Serverless Functions - upload code and it runs without provisioning servers or architecture. Good fit for short-running tasks where you don't need to customize the OS or environment.",
	"Supports 7 runtimes":[
		"Ruby",
		"Python",
		"Java",
		"NodeJS",
		"C#",
		"PowerShell",
		"Go"
	],
	"notes": [
		"Adjustable duration timeout upto 15 min and memory size up to 3008 MB.",
		"Can be triggered from SDK or multiple services (S3, API Gateway, DynamoDB, etc)",
		"Use no VPC by default, but can use a VPC to interact with your other services, like RDS.",
		"Can scale to 1000 (default) concurrent functions. Can increase this default as an AWS Service Limit increase.",
		"Cold Starts - if not used recently there will be a startup delay.",
		"For longer than 15 minutes or a custom OS environment, consider Fargate/ECS"
	]
},
{
	"cost":"Free",
	"name":"LandingZone",
	"ownership":"Amazon",
	"useCase":"Entry point for multi-account access.",
	"notes": [
		"Foundational"
	]
},
{
	"name":"Lex",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Conversational service with the same tech that operates Amazon Alexa"
},
{
	"name":"Lightsail",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"If you don't care about the infra and just want to deploy a Wordpress site."
},
{
	"name":"MapReduce",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Apache Spark, lets you do massive parallel processing on data sets."
},
{
	"name":"MSK",
	"ownership":"Amazon",
	"stack":"MQ",
	"type":"PaaS",
	"useCase":"Fully managed Apache Kafka message queue"
},
{
	"name":"Neptune (ODS)",
	"ownership":"Amazon",
	"stack":"Graph DB",
	"type":"PaaS",
	"useCase":"Social graph or recommendation engine."
},
{
	"name":"Organizations",
	"ownership":"Amazon",
	"notes": [
		"Foundational"
	]
},
{
	"name":"Outposts",
	"ownership":"Amazon",
	"type":"IaaS",
	"useCase":"Run AWS APIs on your servers."
},
{
	"name":"Quantum Ledger DB (ODS)",
	"ownership":"Amazon",
	"stack":"Blockchain",
	"type":"PaaS"
},
{
	"encryption":"(Is there any non-public info in DNS?)",
	"name":"Route 53",
	"ownership":"Amazon",
	"stack":"DNS",
	"type":"IaaS",
	"useCase":"DNS provider, registrar, and domain manager.",
	"notes": [
		"Traffic Flow: Visual editor for chaining routing policies, has versioning for easy rollback.",
		"Alias Record - AWS' smart record - it detects changed IP addresses and updates automatically. (How - is it a type of reverse DNS?)",
		"R53 Resolver: Lets you regionally route DNS queries between your VPCs and your hybrid network.",
		"Health checks can monitor and automatically reroute between endpoints. And health checks can monitor other health checks."
	],
	"Routing types":[
		"Simple: Default, multiple addresses result in random endpoint selection.",
		"Weighted: Assign percentages to different routes.",
		"Latency-based: Directs traffic based on region to get lowest latency.",
		"Failover: Directs traffic to secondary site only if primary site is down.",
		"Geolocation: Route based on geographic location.",
		"Geo-proximity: Add Bias to Geolocation (requires R53 Traffic Flow)",
		"Multi-Value Answer: Return multiple answers (using health checks)"
	]
},
{
	"encryption":"at rest with KMS, in motion with HTTPS.",
	"name":"RDS",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Relational Database Service",
	"Automatic Backups":[
		"You can set a schedule.",
		"No additional cost.",
		"Retention window between 1 and 35 days."
	],
	"Manual Snapshots": [
		"Can restore database from snapshot."
	],
		"6 database flavors": [
			"Aurora",
			"MariaDB",
			"MSSQL",
			"MySQL",
			"Oracle",
			"PostGres"
	],
	"Aurora notes":[
		"Fully-managed PostGres or MySQL with scaling, HA, and fault tolerance.",
		"5x faster than MySQL and 3x faster than PostGres, on same flavor. (How much faster than MySQL is the PostGres one? How do MySQL and PG compare?)",
		"Pricing is about 1/10 other flavors.",
		"Data stored as 6 copies in 3 regions.",
		"Can span regions with Global Database.",
		"Aurora Serverless allows starting, stopping, and scaling - for new projects or those with infrequent DB use - to keep costs low."
	],
	"PostGres notes":[
		"Multi-AZ replicates a standby copy of your DB to another AZ, and keeps it up to date.",
		"Automatic Failover will automatically promote to master the standby copy if the main DB's AZ goes down.",
		"Read-Replicas "
	],
	"notes": [
		"Instances are managed and cannot be accessed.",
		"Allow you to run multiple read-only copies of your DB, to improve performance",
		"Uses asynchronous replication. (What's the significance of this?) ",
		"Requires automatic backups be setup.",
		"Limit of 5, except Aurora can have 15.",
		"Can be multi-AZ and use Read-Replicas.",
		"Can be in another region (Cross-Region Read-Replicas)",
		"Can be promoted to their own database, but this breaks replication.",
		"You can have replicas of Read-Replicas. (Can you have Read-Replicas of Read-Replicas?)"
	]
},
{
	"cost":" Billed per hour for single-nodes and compute nodes.",
	"encryption":"KMS or CloudHSM",
	"name":"Redshift (ODS)",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Analytics data store (shift away from Oracle) - dump multiple data sets in one place.",
	"BI(g) Data warehousing":[
		"Can handle petabytes of data. Data in a warehouse is structured.",
		"Columnar Store OLAP DB that takes SQL-like queries.",
		"Can ingest data from S3, EMR, DynamoDB, or multiple sources on remote hosts.",
		"Limited to single-AZ.",
		"Single-node or multi-node (clustered)."
	],
	"notes": [
		"Each node holds 160 GB.",
		"Multi-node has a leader node and upto 128 compute nodes. Leader node is free.",
		"Two node types: Dense Compute and Dense Storage",
		"Attempts 3 backup copies: Original, Compute, S3.",
		"Uses sequential HDD caching.",
		"Backup retention default is 1 day, can be set up to 35 days.",
		"Can asynchronously backup snapshots to another region's S3 bucket.",
		"Uses massively parallel processing (MPP) to distribute queries and data.",
		"Uses sample data to create an empty table."
	]
},
{
	"cost":"free",
	"encryption":"N/A",
	"name":"Registry of Open Data ",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"Use a public data set, like the Cancer Genome Atlas, USGS LandSat, NOAA GOES, etc."
},
{
	"name":"Rekognition",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Image classification API"
},
{
	"name":"Robomaker",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"robot simulators"
},
{
	"name":"S3",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"Storage drives in the cloud",
	"S3-storageClasses":[],
	"S3-transfer":[]
},
{
	"name":"S3-snowball",
	"ownership":"Amazon",
	"type":"SaaS"
},
{
	"name":"Sagemaker",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Use Tensorflow or Pytorch with a managed Jupyter notebook that can connect to a GPU."
},
{
	"name":"SDK",
	"ownership":"Amazon",
	"type":"PaaS",
	"notes": [
		"Programmatic Access must be setup from IAM"
	],
	"Available languages": [
		"C++",
		" Go",
		" Java",
		" JS & NodeJS",
		" .NET",
		" PHP",
		" Python",
		" Ruby"
	]
},
{
	"name":"Serverless repos",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"Lambda Marketplace"
},
{
	"name":"SES",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"can send emails"
},
{
	"name":"SimpleDB (ODS)",
	"ownership":"Amazon",
	"type":"PaaS",
	"useCase":"Basic NoSQL DB."
},
{
	"name":"Snow Mobile Core",
	"ownership":"Amazon",
	"useCase":"Provides a suite of services (Systems Manager, Config, CloudWatch, AutoScaling, CloudFormation, CloudTrail, S3, SAS, VPC Management Tools, Provisioning and Subscriber tools, Mobile core control plane through a 5G or 4G connection.)",
	"type":"IaaS",
	"notes":[
		"Also called SnowCone?"
	]
},
{
	"name":"SNS",
	"ownership":"Amazon",
	"type":"SaaS",
	"useCase":"can send push notifications to your app."
},
{
	"cost":" Services are billed separately below.",
	"name":"Storage Gateway",
	"ownership":"Amazon",
	"type":"IaaS",
	"useCase":"Data transfer agent deployed on a VM or hardware device in your network, or as EC2 or VMWare Cloud VM.",
	"notes": [
		"The AWS Hardware Appliance is available exclusively through resellers, including CDW.",
		"Data Transfer from your gateway appliance to the AWS Storage Gateway service is free.",
		"Data Transfer from the AWS Storage Gateway service to your on-premises gateway appliance ",
		"| TB/Month | per GB | ",
		"| 9.999 | $0.09 |",
		"| 40 | $0.085 |",
		"| 100 | $0.07 |",
		"| -gt 150 | $0.05 |",
		"Data Transfer from the AWS Storage Gateway service to an Amazon EC2-based gateway appliance in the same region is free.",
		"Data Transfer from the AWS Storage Gateway service to your gateway appliance in other regions is $0.02 per GB currently."
	],
	"S3 Gateway": [
		"Storage Cost: S3 rate",
		"Transfer Cost: The first 100 GB into AWS per account is free, then $0.01 per GB up to a maximum of $125.00 per gateway per month. (Billed as Amazon S3 requests.)"
	],
	"FSx Gateway": [
		"Gateway Cost: $0.69 per Hour",
		"Storage Cost: FSx for Windows rate",
		"Transfer Cost: (None listed)"
	],
	"Tape Gateway": [
		"Gateway Cost: ",
		"Storage tiers: (per GB-month)",
	"Standard: $0.023 ",
	"Glacier Flexible Retrieval: $0.0036 ",
	"Glacier Deep Archive: $0.00099",
		"Transfer Cost: The first 100 GB into AWS per account is free, then $0.01 per GB up to a maximum of $125.00 per gateway per month.",
		"Retrieval tiers: (per GB)",
	"Standard: $0.01 ",
	"Glacier Flexible Retrieval: $0.02 ",
	"Glacier Deep Archive: $0.0032",
		"Early Deletion tiers: (per GB)",
	"Standard: None listed",
	"Glacier Flexible Retrieval: $0.0108 (Prorated across 90 days.)",
	"Glacier Deep Archive: $0.00099 (Prorated across 180 days.)",
		"Archival: Free (what does this entail?)"
	],
	"Volume Gateway": [
		"Gateway Cost: ",
		"Storage Cost: $0.023 per GB-month of data stored",
		"EBS Snapshot storage - Stored and billed as Amazon EBS snapshots.",
		"Transfer Cost: The first 100 GB into AWS per account is free, then $0.01 per GB up to a maximum of $125.00 per gateway per month."
	]
},
{
	"name":"STS",
	"ownership":"Amazon",
	"type":"PaaS",
	"notes": [
		"Foundational"
	]
},
{
	"name":"Transit Gateway",
	"ownership":"Amazon",
	"stack":"Persistent Data Storage",
	"type":"IaaS"
},
{
	"name":"Timestream (ODS)",
	"ownership":"Amazon",
	"stack":"Time-series DB",
	"type":"PaaS",
	"useCase":"Time series database with built-in time-based queries and analytics"
},
{
	"name":"Trainium ML",
	"ownership":"Amazon",
	"stack":"ML",
	"type":"PaaS",
	"useCase":"Machine Learning ASICs can improve training speed while reducing costs.",
	"notes": [
		"Training hardware Trn1"
	]
},
{
	"name":"VMWare Cloud",
	"ownership":"Amazon",
	"stack":"Hypervisor",
	"type":"IaaS",
	"useCase":"Rehost VMWare workloads in AWS before/while pursuing a more cloud-native tech strategy."
},
{
	"cost":"free",
	"encryption":"Unsure",
	"name":"VPC",
	"ownership":"Amazon",
	"stack":"Networking Isolation",
	"type":"IaaS",
	"useCase":"Container for other AWS IaaS and PaaS products, and can have Endpoints for AWS SaaS, products.",
	"VPC-endpoints": [],
	"VPC-flowLogs": [],
	"VPC-nacls": [],
	"VPC-nat": [],
	"VPC-securityGroups": []
},
{
	"name":"Cloud Audit Academy",
	"ownership":"Amazon",
	"stack":"Training",
	"type":"IaaS",
	"useCase":"Learn about audits in AWS."
},
{
	"name":"AzureAD",
	"ownership":"Microsoft",
	"stack":"Auth",
	"type":"SaaS",
  	"useCase":"Serverless Active Directory"
},
{
	"name":"Windows 365",
	"ownership":"Microsoft",
	"stack":"Desktop",
	"type":"IaaS",
  	"useCase":"Package sort for physical logistics throughput."
},
{
	"name":"Excel Live",
	"ownership":"Microsoft",
	"stack":"Application",
	"type":"SaaS",
  	"useCase":"Embed a live-edit Excel spreadsheet into your Teams meeting."
},
{
	"freeTier": [
		"Serverless: Free 5GiB Storage & 250M Request Units/month"
	],
	"paidTier": [
		"Serverless: $1 per additional 1GiB storage, $1 per additional 10M RUs",
		"Dedicated AWS IOPS: 1IOPS = $0.0000196/hr (1k IOPS = $0.0196)",
		"Dedicated AWS storage: 1GB = $0.0005088/hr (1TB = $0.5088)",
		"Dedicated GCP storage: 1GB = $0.0011986/hr (1TB - $1.1986)"
	],
	"Dedicated AWS compute":[
		"vCPU: $/hr (rate : change)",
		"2: $0.51 ($0.255 : 0)",
		"4: $0.90 ($0.225 : 88.2%)",
		"8: $1.60 ($0.2 : 88.89%)",
		"16: $3.11 ($0.194 : 97.2%)",
		"32: $5.34 ($0.167 : 85.9%)"
	],
	"Dedicated GCP compute":[
		"vCPU: $/hr (rate : change)",
		"2: $0.43 ($0.215 : 0%)",
		"4: $0.71 ($0.178 : 82.8%)",
		"8: $1.18 ($0.148 : 83.1%)",
		"16: $2.30 ($0.144 : 97.3%)",
		"32: $4.20 ($0.131 : 91.0%)"
	],
	"Crunchbase":"https://www.crunchbase.com/organization/cockroach-labs",
	"Glassdoor":"https://www.glassdoor.com/Overview/Working-at-Cockroach-Labs-EI_IE1168502.11,25.htm",
	"name":"CockroachDB",
	"Website":"https://www.cockroachlabs.com/",
	"stack":"Relational DB",
	"ownership":"Pre-IPO",
	"type":"Infra",
  	"useCase":"PostGres-ish SQL structured server software, designed for high scalability leading to high availability, with Infra and Serverless options.",
	"notes":[
		"Designed to be highly PG compliant, and some applications might 'just work'."
	]
},
{
	"name":"Freevee",
	"ownership":"Amazon",
  	"useCase":"Free (ad-supported?) video streaming service."
},
{
	"name":"ClearScale",
	"Website":"https://www.clearscale.com/",
	"stack":"Consulting",
	"ownership":"Private",
	"Crunchbase":"https://www.crunchbase.com/organization/clearscale",
	"Glassdoor":"https://www.glassdoor.com/Overview/Working-at-ClearScale-EI_IE1183929.11,21.htm",
  	"useCase":"AWS Consulting Partner"
},
{
	"freeTier":"Open Source",
	"encryption":"Most data is exposed to the filesystem and memory. Recommends using Docker secrets/ directory to store API keys and other sensitive data.",
	"name":"Jenkins",
	"Website":"https://www.jenkins.io/",
	"Overview":"https://www.lambdatest.com/blog/what-is-jenkins/",
	"InstallLink":"https://www.jenkins.io/download/",
	"stack":"CI/CD",
	"type":"Infra",
	"useCase":"The leading open source automation server",
	"notes":[
		"Jenkins is distributed as WAR files, native packages, installers, and Docker images."
	]
},
{
	"name":"Splunk",
	"Website":"https://www.splunk.com/",
	"stack":"Monitoring",
	"ownership":"Stock Price $103.91 (7/29/2022)",
	"Crunchbase":"https://www.crunchbase.com/organization/splunk",
	"Glassdoor":"https://www.glassdoor.com/Reviews/Splunk-Reviews-E117313.htm",
  	"useCase":"Data analytics collection and dashboarding."
},
{
	"name":"Perpetua",
	"Website":"https://perpetua.io/",
	"ownership":"Pre-IPO",
	"Crunchbase":"https://www.crunchbase.com/organization/perpetua-labs",
	"Glassdoor":"https://www.glassdoor.com/Overview/Working-at-Perpetua-EI_IE1671941.11,19.htm",
  	"useCase":"eCommerce Advertising Software"
},
{
	"name":"Acumatica",
	"Website":"https://www.acumatica.com/",
	"stack":"ERP",
	"ownership":"INVESTOR AB or EQT",
	"Crunchbase":"https://www.crunchbase.com/organization/acumatica",
	"Glassdoor":"https://www.glassdoor.com/Overview/Working-at-Acumatica-EI_IE562378.11,20.htm",
  	"useCase":"Cloud Business Management Software"
},
{
	"name":"Digital Ocean",
	"stack":"Cloud Host",
	"ownership":"Stock Price $40.98 (7/29/2022)",
	"Crunchbase":"https://www.crunchbase.com/organization/digitalocean",
	"Glassdoor":"https://www.glassdoor.com/Overview/Working-at-DigitalOcean-EI_IE823482.11,23.htm",
	"type":"IaaS",
  	"useCase":"Cloud Host"
},
{
	"name":"Business One",
	"stack":"ERP",
	"ownership":"SAP"
},
{
	"name":"Sage Intacct",
	"ownership":"Stock Price $34.35 (7/29/2022)",
	"Glassdoor":"https://www.glassdoor.com/Overview/Working-at-Sage-EI_IE1150.11,15.htm"
},
{
	"name":"Oracle NetSuite"
},
{
	"name":"Unanet GovCon"
},
{
	"name":"TallyPrime"
},
{
	"name":"S/4Hana Cloud",
	"ownership":"SAP"
},
{
	"name":"Total ETO"
},
{
	"name":"MIE Trak Pro"
},
{
	"name":"Odoo",
	"stack":"ERP"
},
{
	"name":"BisTrack",
	"ownership":"Epicor"
},
{
	"name":"ByD",
	"ownership":"SAP"
},
{
	"name":"Kinetic",
	"ownership":"Epicor"
},
{
	"name":"JupiterOne"
},
{
	"name":"Snowflake",
  	"useCase":"Very big data"
},
{
	"name":"Flywheel"
},
{
	"name":"SonicWall"
},
{
	"encryption":"No",
	"name":"Qualys",
  	"useCase":"Scan all ports on all hosts on your network, and report back which ones are open, alongside scary reports of which kinds of hacks hold open these ports."
},
{
	"name":"Apica",
  	"useCase":"Find vulnerabilities in your dependencies, Codesmells Dashboards."
},
{
	"name":"Snyk",
  	"useCase":"Find vulnerabilities in your dependencies."
},
{
	"name":"Zeck",
  	"useCase":"Board Deck creation software (automation?)",
	"notes":[
		"Quirky sense of humor, or unprofessional presentation?"
	]
},
{
	"name":"RapidAPI"
},
{
	"name":"Jetstack"
},
{
	"name":"Broadcade"
},
{
	"name":"HTE"
},
{
	"name":"Rapid7"
},
{
	"name":"Autobox"
},
{
	"name":"Ansible",
	"ownership":"Red Hat",
	"Tutorial":"https://codingbee.net/ansible/ansible-a-hello-world-playbook",
	"Overview":"https://www.ansible.com/overview/how-ansible-works?hsLang=en-us",
	"InstallLink":"https://docs.ansible.com/ansible/latest/installation_guide/index.html",
	"stack":"Infra as Code",
	"type":"ControlPlane",
	"useCase":"Delivers simple IT automation that ends repetitive tasks and frees up DevOps teams for more strategic work.",
	"notes":[
		"Code files are called Playbooks and use YAML format."
	]
},
{
	"name":"Infra",
	"ownership":"Chef",
	"Website":"https://www.chef.io/products/chef-infra",
	"InstallLink":"https://docs.chef.io/windows/",
	"Github":"https://gist.github.com/dhana-git/700da979e8c0d39f7ee74ad5ba8e5f1f",
	"stack":"Infra as Code",
	"type":"ControlPlane",
	"useCase":"Powerful Policy-Based Configuration Management System Software"
},
{
	"freeTier":"No server limit, but no permissions (all users are admins).",
	"paidTier":[
		"Basic: $1,995/yr for upto 100 servers.",
		"Enterprise: $9,995/yr for upto 100 servers. Includes HA clustering, SAML SSO, and configuration drift tools."
	],
	"name":"Otter",
	"ownership":"Inedo",
	"Website":"https://inedo.com/otter",
	"InstallLink":"https://inedo.com/otter/download",
	"stack":"Infra as Code",
	"type":"ControlPlane",
	"useCase":"Provision your servers and manage configuration",
	"notes":[
		"Pricing page is a little unclear, and makes services seem nearly identical, until you've looked at it for a few minutes."
	]

},
{
	"freeTier":"",
	"paidTier":"",
	"name":"Salt",
	"ownership":"Pre-IPO",
	"Website":"https://saltproject.io/",
	"Tutorial":"https://crate.io/blog/infrastructure-as-code-configuration-with-salt",
	"Github":"https://github.com/saltstack/salt-pack",
	"InstallLink":"https://docs.saltproject.io/en/latest/topics/installation/index.html",
	"stack":"Infra as Code",
	"type":"ControlPlane",
	"useCase":"Automation, infrastructure management, its data-driven orchestration, remote execution, configuration management, and so much more."
},
{
	"freeTier":"Linux only, basic features.",
	"paidTier":"Call for quote. Windows, AIX, Solaris, and HP-UX OSes, REST API and web portal, alerts & triggers, reporting.",
	"encryption":"",
	"HaDrBc":"",
	"name":"CFEngine",
	"ownership":"",
	"InstallLink":"https://cfengine.com/downloads/quick-install/",
	"Github":"https://github.com/cfengine",
	"Website":"https://cfengine.com/download/",
	"stack":"Infra as Code",
	"type":"ControlPlane",
	"useCase":""
},
{
	"name":"Terraform",
	"useCase":"Automate infrastructure provisioning on any cloud",
	"stack":"Infra as Code",
	"InstallLink":"https://www.terraform.io/downloads",
	"Tutorial":"https://learn.hashicorp.com/tutorials/terraform/aws-build?in=terraform/aws-get-started"
},
{
	"name":"Traefik",
	"type":"Infra",
  	"useCase":"Load balancing router designed for containerization."

},
{
	"name":"Redbear",
  	"useCase":"Australian MSP"
},
{
	"freeTier":"Open Source",
	"name":"SQLite",
	"type":"Infra",
  	"useCase":"Lightweight SQL as flat files."
},
{
	"freeTier":"Open Source",
	"name":"NGINX (Engine-X)",
	"type":"Infra",
  	"useCase":"High-volume webserver, caching reverse proxy.",
	"video":"<iframe width='560' height='315' src='https://www.youtube.com/embed/JKxlsvZXG7c' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
	"notes":[
	"Defaults to programmatic file handling."
	]

},
{
	"name":"Tailwind",
  	"useCase":"Provides CSS utility classes to be combined into your desired style.",
	"video":"<iframe width='560' height='315' src='https://www.youtube.com/embed/mr15Xzb1Ook' title='YouTube video player' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>",
	"notes":[
		"Use @apply keyword in normal CSS to prevent boilerplating.",
		"VSCode aids in utility class disambiguation."
	]
},
{
	"name":"CircleCI",
  	"useCase":"CI/CD testing",
	"stack":"CI/CD"
},
{
	"name":"Crunchbase",
  	"useCase":"Info about companies - Bloomberg competitor?"
},
{
	"name":"Glassdoor",
  	"useCase":"Employee reviews of companies."
},
{
	"name":"Optum Cloud",
	"type":"PaaS",
  	"useCase":"Remote primary hosting, data recovery, and backup hosting. (Cloud Partner / MSP?)",
	"notes":[
		"Not to be confused with OptumCare."
	]
},
{
	"name":"Amazon Sortation Center",
	"ownership":"Amazon",
	"type":"SaaS",
  	"useCase":"Package sort for physical logistics throughput."
},
{
	"name":"Interview Kickstart",
	"Website":"https://learn.interviewkickstart.com/",
	"type":"Education",
  	"useCase":"MANGA (formerly FAANG) interview prep and hiring advice."},
{
	"name":"Metis",
	"Website":"https://www.thisismetis.com/",
	"type":"Education",
  	"useCase":"Data Science & Analytics Bootcamps"
},
{
	"name":"Milli",
	"type":"SaaS"
},
{
	"name":"CrowdStrike",
	"type":"SaaS",
  	"useCase":"Broad security threat prevention"
},
{
	"name":"Elementium",
	"type":"SaaS",
  	"useCase":"Enterprise service supply chain management"
},
{
	"name":"HYCU (Haiku)",
	"type":"SaaS",
  	"useCase":"Backup/DR "
},
{
	"name":"Cox2M",
	"type":"SaaS",
  	"useCase":"Corporate vehicle tracking"
},
{
	"name":"Proposify",
	"type":"SaaS",
  	"useCase":"Corporate Proposals?"
},
{
	"name":"Rubrik",
	"type":"SaaS",
  	"useCase":"Zero Trust Data Security"
},
{
	"name":"Meetaverse",
	"type":"SaaS",
  	"useCase":"Create a custom corporate metaverse that your entire organization will love."
}]
